package com.sixj.multilingual.translater;

import cn.hutool.core.util.StrUtil;

import java.util.*;

/**
 * @author sixiaojie
 * @date 2020-08-14-18:44
 */
public class TranslaterDemo {
    public static void main(String[] args) throws Exception {


        String s = "/** 乌兹别克语 */\n" +
                "UZ(\"uz\"),\n" +
                "/** 保加利亚语 */\n" +
                "BG(\"bg\"),\n" +
                "/** 萨摩亚语 */\n" +
                "SM(\"sm\"),\n" +
                "/** 爪哇语 */\n" +
                "JV(\"jv\"),\n" +
                "/** 马拉提语 */\n" +
                "MR(\"mr\"),\n" +
                "/** 英语 */\n" +
                "EN(\"en\"),\n" +
                "/** 塞尔维亚-克罗地亚语 */\n" +
                "SH(\"sh\"),\n" +
                "/** 阿姆哈拉语 */\n" +
                "AM(\"am\"),\n" +
                "/** 克罗地亚语 */\n" +
                "HR(\"hr\"),\n" +
                "/** 斯洛文尼亚语 */\n" +
                "SL(\"sl\"),\n" +
                "/** 奥利亚语 */\n" +
                "OR(\"or\"),\n" +
                "/** 马拉亚拉姆语 */\n" +
                "ML(\"ml\"),\n" +
                "/** 亚美尼亚语 */\n" +
                "HY(\"hy\"),\n" +
                "/** 德语 */\n" +
                "DE(\"de\"),\n" +
                "/** 蒙古语 */\n" +
                "MN(\"mn\"),\n" +
                "/** 波斯语 */\n" +
                "FA(\"fa\"),\n" +
                "/** 马达加斯加语 */\n" +
                "MG(\"mg\"),\n" +
                "/** 刚果语 */\n" +
                "KG(\"kg\"),\n" +
                "/** 马其顿语 */\n" +
                "MK(\"mk\"),\n" +
                "/** 依地语 */\n" +
                "YI(\"yi\"),\n" +
                "/** 格鲁吉亚语 */\n" +
                "KA(\"ka\"),\n" +
                "/** 卡纳达语 */\n" +
                "KN(\"kn\"),\n" +
                "/** 丹麦语 */\n" +
                "DA(\"da\"),\n" +
                "/** 科西嘉语 */\n" +
                "CO(\"co\"),\n" +
                "/** 巴斯克语 */\n" +
                "EU(\"eu\"),\n" +
                "/** 阿拉伯语 */\n" +
                "AR(\"ar\"),\n" +
                "/** 马耳他语 */\n" +
                "MT(\"mt\"),\n" +
                "/** 南索托语 */\n" +
                "ST(\"st\"),\n" +
                "/** 斯瓦希里语 */\n" +
                "SW(\"sw\"),\n" +
                "/** 加泰隆语 */\n" +
                "CA(\"ca\"),\n" +
                "/** 阿塞拜疆语 */\n" +
                "AZ(\"az\"),\n" +
                "/** 高棉语 */\n" +
                "KM(\"km\"),\n" +
                "/** 拉脱维亚语 */\n" +
                "LV(\"lv\"),\n" +
                "/** 现代希腊语 */\n" +
                "EL(\"el\"),\n" +
                "/** 塞尔维亚语 */\n" +
                "SR(\"sr\"),\n" +
                "/** 阿非利堪斯语 */\n" +
                "AF(\"af\"),\n" +
                "/** 波斯尼亚语 */\n" +
                "BS(\"bs\"),\n" +
                "/** 冰岛语 */\n" +
                "IS(\"is\"),\n" +
                "/** 维吾尔语 */\n" +
                "UG(\"ug\"),\n" +
                "/** 毛利语 */\n" +
                "MI(\"mi\"),\n" +
                "/** 基尼阿万达语 */\n" +
                "RW(\"rw\"),\n" +
                "/** 印地语 */\n" +
                "HI(\"hi\"),\n" +
                "/** 书面挪威语 */\n" +
                "NB(\"nb\"),\n" +
                "/** 伊博语 */\n" +
                "IG(\"ig\"),\n" +
                "/** 尼扬贾语 */\n" +
                "NY(\"ny\"),\n" +
                "/** 尼泊尔语 */\n" +
                "NE(\"ne\"),\n" +
                "/** 泰米尔语 */\n" +
                "TA(\"ta\"),\n" +
                "/** 波兰语 */\n" +
                "PL(\"pl\"),\n" +
                "/** 信德语 */\n" +
                "SD(\"sd\"),\n" +
                "/** 匈牙利语 */\n" +
                "HU(\"hu\"),\n" +
                "/** 普什图语 */\n" +
                "PS(\"ps\"),\n" +
                "/** 阿尔巴尼亚语 */\n" +
                "SQ(\"sq\"),\n" +
                "/** 吉尔吉斯语 */\n" +
                "KY(\"ky\"),\n" +
                "/** 世界语 */\n" +
                "EO(\"eo\"),\n" +
                "/** 白俄罗斯语 */\n" +
                "BE(\"be\"),\n" +
                "/** 爱尔兰语 */\n" +
                "GA(\"ga\"),\n" +
                "/** 科萨语 */\n" +
                "XH(\"xh\"),\n" +
                "/** 缅甸语 */\n" +
                "MY(\"my\"),\n" +
                "/** 加利西亚语 */\n" +
                "GL(\"gl\"),\n" +
                "/** 塔加洛语 */\n" +
                "TL(\"tl\"),\n" +
                "/** 朝鲜语、韩语 */\n" +
                "KO(\"ko\"),\n" +
                "/** 塔吉克语 */\n" +
                "TG(\"tg\"),\n" +
                "/** 威尔士语 */\n" +
                "CY(\"cy\"),\n" +
                "/** 索马里语 */\n" +
                "SO(\"so\"),\n" +
                "/** 葡萄牙语 */\n" +
                "PT(\"pt\"),\n" +
                "/** 越南语 */\n" +
                "VI(\"vi\"),\n" +
                "/** 旁遮普语 */\n" +
                "PA(\"pa\"),\n" +
                "/** 俄语 */\n" +
                "RU(\"ru\"),\n" +
                "/** 日语 */\n" +
                "JA(\"ja\"),\n" +
                "/** 塔塔尔语 */\n" +
                "TT(\"tt\"),\n" +
                "/** 意大利语 */\n" +
                "IT(\"it\"),\n" +
                "/** 爱沙尼亚语 */\n" +
                "ET(\"et\"),\n" +
                "/** 土耳其语 */\n" +
                "TR(\"tr\"),\n" +
                "/** 豪萨语 */\n" +
                "HA(\"ha\"),\n" +
                "/** 罗马尼亚语 */\n" +
                "RO(\"ro\"),\n" +
                "/** 法语 */\n" +
                "FR(\"fr\"),\n" +
                "/** 古吉拉特语 */\n" +
                "GU(\"gu\"),\n" +
                "/** 祖鲁语 */\n" +
                "ZU(\"zu\"),\n" +
                "/** 约鲁巴语 */\n" +
                "YO(\"yo\"),\n" +
                "/** 西班牙语 */\n" +
                "ES(\"es\"),\n" +
                "/** 摩尔达维亚语 */\n" +
                "MO(\"mo\"),\n" +
                "/** 僧加罗语 */\n" +
                "SI(\"si\"),\n" +
                "/** 荷兰语 */\n" +
                "NL(\"nl\"),\n" +
                "/** 马来语 */\n" +
                "MS(\"ms\"),\n" +
                "/** 卢森堡语 */\n" +
                "LB(\"lb\"),\n" +
                "/** 捷克语 */\n" +
                "CS(\"cs\"),\n" +
                "/** 中文、汉语 */\n" +
                "ZH(\"zh\"),\n" +
                "/** 挪威语 */\n" +
                "NO(\"no\"),\n" +
                "/** 绍纳语 */\n" +
                "SN(\"sn\"),\n" +
                "/** 弗里西亚语 */\n" +
                "FY(\"fy\"),\n" +
                "/** 土库曼语 */\n" +
                "TK(\"tk\"),\n" +
                "/** 库尔德语 */\n" +
                "KU(\"ku\"),\n" +
                "/** 乌尔都语 */\n" +
                "UR(\"ur\"),\n" +
                "/** 老挝语 */\n" +
                "LO(\"lo\"),\n" +
                "/** 芬兰语 */\n" +
                "FI(\"fi\"),\n" +
                "/** 印尼语 */\n" +
                "ID(\"id\"),\n" +
                "/** 哈萨克语 */\n" +
                "KK(\"kk\"),\n" +
                "/** 苏格兰盖尔语 */\n" +
                "GD(\"gd\"),\n" +
                "/** 拉丁语 */\n" +
                "LA(\"la\"),\n" +
                "/** 瑞典语 */\n" +
                "SV(\"sv\"),\n" +
                "/** 泰卢固语 */\n" +
                "TE(\"te\"),\n" +
                "/** 孟加拉语 */\n" +
                "BN(\"bn\"),\n" +
                "/** 乌克兰语 */\n" +
                "UK(\"uk\"),\n" +
                "/** 立陶宛语 */\n" +
                "LT(\"lt\"),\n" +
                "/** 泰语 */\n" +
                "TH(\"th\"),\n" +
                "/** 斯洛伐克语 */\n" +
                "SK(\"sk\"),\n" +
                "/** 海地克里奥尔语 */\n" +
                "HT(\"ht\"),\n" +
                "/** 巽他语 */\n" +
                "SU(\"su\"),";

        List<String> enumList = StrUtil.split(s, ',', true, true);
        enumList.sort(Comparator.comparing(TranslaterDemo::comp));
        for (String s1 : enumList) {
            System.out.println(a(s1));
        }




    }
    private static String comp(String s){
        List<String> split = StrUtil.split(s, '(', true, true);
        return split.get(1);
    }

    private static String a(String s){
        String desc = s.substring(s.indexOf("/** ")+4, s.indexOf(" */"));
        String replace = s.replace(")", ",\"" + desc + "\",false),");
        return replace.substring(replace.indexOf("*/")+2,replace.lastIndexOf(",")+1);
    }
}
